docs/index.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es"><head><meta http-equiv="Content-Type" content="text/html;charset=utf-8"><meta name="viewport" content="width=device-width, initial-scale=1"><title>Juegos web</title><meta name="author" content="Carlos León"><meta name="generator" content="Org Mode"></head><body> <div id="content" class="content"> <h1 class="title">Juegos web</h1> <div id="outline-container-orgda6e159" class="outline-2"> <h2 id="orgda6e159"><span class="section-number-2">1.</span> Histórico</h2> <div class="outline-text-2" id="text-1"> <ul class="org-ul"> <li><a href="/historico.html">historico.org</a></li> </ul> </div> </div> <div id="outline-container-org179b37f" class="outline-2"> <h2 id="org179b37f"><span class="section-number-2">2.</span> Introducción a los juegos web</h2> <div class="outline-text-2" id="text-2"> <ul class="org-ul"> <li><a href="/tooling.reveal.html">tooling.reveal.org</a></li> <li><a href="/dom.reveal.html">dom.reveal.org</a></li> <li><a href="/async.reveal.html">async.reveal.org</a></li> <li><a href="/creacion_paginas_web.reveal.html">creacion_paginas_web.reveal.org</a></li> <li><a href="/canvas.reveal.html">canvas.reveal.org</a></li> <li><a href="/showcase.reveal.html">showcase.reveal.org</a></li> <li><a href="/mlpggj2020.reveal.html">mlpggj2020.reveal.org</a></li> </ul> </div> </div> <div id="outline-container-org7a8b1d5" class="outline-2"> <h2 id="org7a8b1d5"><span class="section-number-2">3.</span> JavaScript</h2> <div class="outline-text-2" id="text-3"> <ul class="org-ul"> <li><a href="/javascript_modelo_datos_1.reveal.html">javascript_modelo_datos_1.reveal.org</a></li> <li><a href="/javascript_modelo_datos_2.reveal.html">javascript_modelo_datos_2.reveal.org</a></li> <li><a href="/javascript_modelo_ejecucion.reveal.html">javascript_modelo_ejecucion.reveal.org</a></li> <li><a href="/clases_es6.reveal.html">clases_es6.reveal.org</a></li> <li><a href="/modulos.reveal.html">modulos.reveal.org</a></li> <li><a href="/ejercicios_js.html">ejercicios_js.org</a></li> </ul> </div> </div> <div id="outline-container-org920dce2" class="outline-2"> <h2 id="org920dce2"><span class="section-number-2">4.</span> Arquitectura</h2> <div class="outline-text-2" id="text-4"> <ul class="org-ul"> <li><a href="/poo.reveal.html">poo.reveal.org</a></li> <li><a href="/ejemplo_componentes_completo.reveal.html">ejemplo_componentes_completo.reveal.org</a></li> <li><a href="/introduccion_uml.reveal.html">introduccion_uml.reveal.org</a></li> <li><a href="/introduccion_arquitectura_videojuegos.reveal.html">introduccion_arquitectura_videojuegos.reveal.org</a></li> <li><a href="/ejercicios_arquitectura.html">ejercicios_arquitectura.org</a></li> </ul> </div> </div> <div id="outline-container-org4b70df9" class="outline-2"> <h2 id="org4b70df9"><span class="section-number-2">5.</span> Phaser</h2> <div class="outline-text-2" id="text-5"> <ul class="org-ul"> <li><a href="/introduccion_phaser.reveal.html">introduccion_phaser.reveal.org</a></li> <li><a href="/phaser_entities.reveal.html">phaser_entities.reveal.org</a></li> <li><a href="/input.reveal.html">input.reveal.org</a></li> <li><a href="/texto_en_phaser.reveal.html">texto_en_phaser.reveal.org</a></li> <li><a href="/groups_and_pooling.reveal.html">groups_and_pooling.reveal.org</a></li> <li><a href="/eventos_timer.reveal.html">eventos_timer.reveal.org</a></li> <li><a href="/tiles.reveal.html">tiles.reveal.org</a></li> </ul> </div> </div> <div id="outline-container-org8956652" class="outline-2"> <h2 id="org8956652"><span class="section-number-2">6.</span> Audio</h2> <div class="outline-text-2" id="text-6"> <ul class="org-ul"> <li><a href="/webaudio.reveal.html">webaudio.reveal.org</a></li> <li><a href="/audio_phaser.reveal.html">audio_phaser.reveal.org</a></li> </ul> </div> </div> <div id="outline-container-orgc89547a" class="outline-2"> <h2 id="orgc89547a"><span class="section-number-2">7.</span> Físicas</h2> <div class="outline-text-2" id="text-7"> <ul class="org-ul"> <li><a href="/arcade.reveal.html">arcade.reveal.org</a></li> <li><a href="/matter.reveal.html">matter.reveal.org</a></li> </ul> </div> </div> <div id="outline-container-orgcaec192" class="outline-2"> <h2 id="orgcaec192"><span class="section-number-2">8.</span> Animación</h2> <div class="outline-text-2" id="text-8"> <ul class="org-ul"> <li><a href="/animacion_con_sprites.reveal.html">animacion_con_sprites.reveal.org</a></li> <li><a href="/tweens.reveal.html">tweens.reveal.org</a></li> </ul> </div> </div> <div id="outline-container-orgd257f52" class="outline-2"> <h2 id="orgd257f52"><span class="section-number-2">9.</span> Juegos en red</h2> <div class="outline-text-2" id="text-9"> <ul class="org-ul"> <li><a href="/redes.reveal.html">redes.reveal.org</a></li> <li><a href="/server.reveal.html">server.reveal.org</a></li> <li><a href="/cliente.reveal.html">cliente.reveal.org</a></li> </ul> </div> </div> <div id="outline-container-org1c66b12" class="outline-2"> <h2 id="org1c66b12"><span class="section-number-2">10.</span> Web</h2> <div class="outline-text-2" id="text-10"> <ul class="org-ul"> <li><a href="/interfaces_avanzadas.reveal.html">interfaces_avanzadas.reveal.org</a></li> <li><a href="/pwa.reveal.html">pwa.reveal.org</a></li> </ul> </div> </div> <div id="outline-container-orgc1a0984" class="outline-2"> <h2 id="orgc1a0984"><span class="section-number-2">11.</span> Despliegue</h2> <div class="outline-text-2" id="text-11"> <ul class="org-ul"> <li><a href="/proyectos.reveal.html">proyectos.reveal.org</a></li> <li><a href="/colgar_proyecto.reveal.html">colgar_proyecto.reveal.org</a></li> </ul> </div> </div> </div> <div id="postamble" class="status"> <p class="author">Autor: Carlos León</p> <p class="date">Created: 2025-01-16 jue 10:30</p> <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p> </div> </body></html>